[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestTable.js:75:13
 
   return (
     <OurTable
-      data={requests || []}
+      data={false}
       columns={columns}
       testid={"HelpRequestTable"}
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestTable.js:75:13
 
   return (
     <OurTable
-      data={requests || []}
+      data={true}
       columns={columns}
       testid={"HelpRequestTable"}
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: data.forEach is not a function
