[Killed] LogicalOperator
main/components/Articles/ArticleForm.js:124:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "Date is required. "}
+          {errors.dateAdded || "Date is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
