[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:49:34
           id="itemId"
           type="integer"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: "ItemId is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters for itemId",
-            },
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /ItemId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:71:24
           isInvalid={Boolean(errors.description)}
           {...register("reviewerEmail", {
             required: "ReviewerEmail is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters for email",
-            },
+            maxLength: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters for email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:89:33
           id="stars"
           type="integer"
           isInvalid={Boolean(errors.description)}
-          {...register("stars", {
-            required: "Stars are required.",
-            min: {
-              value: 1,
-              message: "Stars must be at least 1",
-            },
-            max: {
-              value: 5,
-              message: "Stars must be at most 5",
-            },
-          })}
+          {...register("stars", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:89:24
           id="stars"
           type="integer"
           isInvalid={Boolean(errors.description)}
-          {...register("stars", {
+          {...register("", {
             required: "Stars are required.",
             min: {
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:91:18
           isInvalid={Boolean(errors.description)}
           {...register("stars", {
             required: "Stars are required.",
-            min: {
-              value: 1,
-              message: "Stars must be at least 1",
-            },
+            min: {},
             max: {
               value: 5,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be at least 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
