[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:64:24
           id="name"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("name", {
+          {...register("", {
             required: "Name is required.",
           })}
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:64:32
           id="name"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("name", {
-            required: "Name is required.",
-          })}
+          {...register("name", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
